//姓名：王哲源 班级：计算机1班 学号：1652228

#include <iostream>
#include <conio.h>
#include "11-b1-datetime.h"

using namespace std;

void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (_getch() != '\r')
		;
	cout << endl << endl;
}

int main()
{
	//DateTime td1(1941, 7, 10, 4, 13, 25);   //开工
	//DateTime td2(1943, 4, 7, 4, 21, 51);    //下水
	//DateTime td3(1944, 3, 7, 4, 23, 14);    //完工
	//cout << td2 - td1 << endl;              //54950906
	//cout << td3 - td2 << endl;              //28944083

	if (1) {
		DateTime d1;
		DateTime d2(1941, 7, 10, 4, 13, 25);
		DateTime d3(1394193877LL);
		DateTime d4(1996, 2, 29, 1, 1, 1);

		cout << "测试初始化及输出重载，完全正确的赋值" << endl;

		cout << "d1应该是1900-01-01 00:00:00，实际为：";
		cout << d1 << endl;
		cout << "d2应该是1941-07-10 04:13:25，实际为：";
		cout << d2 << endl;
		cout << "d3应该是1944-03-07 12:04:37，实际为：";
		cout << d3 << endl;
		cout << "d4应该是1996-02-29 01:01:01，实际为：";
		cout << d4 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1(1899, 1, 1, 1, 1, 1);
		DateTime d2(2100, 1, 1, 1, 1, 1);
		DateTime d3(1996, 13, 1, 1, 1, 1);
		DateTime d4(1996, 1, 32, 1, 1, 1);
		DateTime d5(1997, 2, 29, 1, 1, 1);
		DateTime d6(1996, 1, 1, 24, 1, 1);
		DateTime d7(1996, 1, 1, 1, 60, 1);
		DateTime d8(1996, 1, 1, 1, 1, 60);

		cout << "测试初始化及输出重载，非法赋值" << endl;

		cout << "应该是均为1900-01-01 00:00:00" << endl;
		cout << "d1输入为d1(1899, 1, 1, 1, 1, 1)， 实际为： " << d1 << endl;
		cout << "d2输入为d2(2100, 1, 1, 1, 1, 1)， 实际为： " << d2 << endl;
		cout << "d3输入为d3(1996, 13, 1, 1, 1, 1)， 实际为： " << d3 << endl;
		cout << "d4输入为d4(1996, 1, 32, 1, 1, 1)， 实际为： " << d4 << endl;
		cout << "d5输入为d5(1997, 2, 29, 1, 1, 1)， 实际为： " << d5 << endl;
		cout << "d6输入为d6(1996, 1, 1, 24, 1, 1)， 实际为： " << d6 << endl;
		cout << "d7输入为d7(1996, 1, 1, 1, 60, 1)， 实际为： " << d7 << endl;
		cout << "d7输入为d8(1996, 1, 1, 1, 1, 60)， 实际为： " << d8 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1(-1);
		DateTime d2(73049LL * 24 * 3600 + 1);

		cout << "测试初始化及输出重载，秒数超出范围" << endl;

		cout << "应该是均为1900-1-1 0:0:0" << endl;
		cout << "d1输入为d1(-1)， 实际为： " << d1 << endl;
		cout << "d2输入为d2(73049LL * 24 * 3600 + 1)， 实际为： " << d2 << endl;

		wait_for_enter();
	}

	if (1) {

		DateTime d1;
		d1.set(1941, 7, 10, 4, 13, 25);
		DateTime d2;
		d2.set(1996, 2, 29, 1, 1, 1);

		cout << "测试set，正确赋值" << endl;
		cout << "d1应该是1941-07-10 04:13:25， 实际为：";
		cout << d1 << endl;
		cout << "d4应该是1996-02-29 01:01:01， 实际为：";
		cout << d2 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1, d2, d3, d4, d5, d6, d7, d8;
		d1.set(1899, 1, 1, 1, 1, 1);
		d2.set(2100, 1, 1, 1, 1, 1);
		d3.set(1996, 13, 1, 1, 1, 1);
		d4.set(1996, 1, 32, 1, 1, 1);
		d5.set(1997, 2, 29, 1, 1, 1);
		d6.set(1996, 1, 1, 24, 1, 1);
		d7.set(1996, 1, 1, 1, 60, 1);
		d8.set(1996, 1, 1, 1, 1, 60);

		cout << "测试set，非法赋值" << endl;

		cout << "应该是均为1900-01-01 00:00:00" << endl;
		cout << "d1输入为d1(1899, 1, 1, 1, 1, 1)， 实际为： " << d1 << endl;
		cout << "d2输入为d2(2100, 1, 1, 1, 1, 1)， 实际为： " << d2 << endl;
		cout << "d3输入为d3(1996, 13, 1, 1, 1, 1)， 实际为： " << d3 << endl;
		cout << "d4输入为d4(1996, 1, 32, 1, 1, 1)， 实际为： " << d4 << endl;
		cout << "d5输入为d5(1997, 2, 29, 1, 1, 1)， 实际为： " << d5 << endl;
		cout << "d6输入为d6(1996, 1, 1, 24, 1, 1)， 实际为： " << d6 << endl;
		cout << "d7输入为d7(1996, 1, 1, 1, 60, 1)， 实际为： " << d7 << endl;
		cout << "d7输入为d8(1996, 1, 1, 1, 1, 60)， 实际为： " << d8 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1;

		cout << "测试cin/cout" << endl;

		cout << "请输入1941 7 10 4 13 25" << endl;
		cin >> d1;
		cout << "d1应该是1941-07-10 04:13:25，实际为：" << d1 << endl;

		cout << "请输入1996 2 29 1 1 1" << endl;
		cin >> d1;
		cout << "d1应该是1996-02-29 01:01:01，实际为：" << d1 << endl;

		cout << "请输入1997 2 29 1 1 1" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		cout << "请输入1899 1 2 3 4 5" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2100 1 2 3 4 5" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		cout << "请输入1998 13 1 1 1 1" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		cout << "请输入1998 1 32 1 1 1" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		cout << "请输入1998 1 1 25 1 1" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		cout << "请输入1998 1 1 1 61 1" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		cout << "请输入1998 1 1 1 1 78" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1(1943, 4, 7, 4, 21, 51);
		DateTime d2, d3;

		cout << "测试+/-" << endl;
		cout << "合法范围内的+/-：" << endl;

		d2 = d1 + 28944083LL;
		cout << "d2应该是1944-03-07 04:23:14，  实际为：" << d2 << endl;

		d2 = 28944083LL + d1;
		cout << "d2应该是1944-03-07 04:23:14，  实际为：" << d2 << endl;

		d2 = d1 - 54950906LL;
		cout << "d2应该是1941-07-10 04:13:25,   实际为：" << d2 << endl;

		d1.set(1941, 7, 10, 4, 13, 25);
		d2.set(1943, 4, 7, 4, 21, 51);
		d3.set(1944, 3, 7, 4, 23, 14);
		cout << "d2-d1应该是54950906，  实际为：" << d2 - d1 << endl;
		cout << "d3-d2应该是28944083，  实际为：" << d3 - d2 << endl;

		cout << endl << endl << "越界的+/-：" << endl;

		d1.set(1900, 1, 1, 0, 0, 0);
		d2 = d1 - 2;
		cout << "d2应该是2099-12-31 23:59:58，  实际为：" << d2 << endl;

		d1.set(2099, 12, 31, 23, 59, 59);
		d2 = d1 + 2;
		cout << "d2应该是1900-01-01 00:00:01，  实际为：" << d2 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1, d2;

		cout << "测试++/--" << endl;

		d1.set(1941, 7, 10, 4, 13, 25);
		d2 = d1++;
		cout << "d1应该是1941-07-10 04:13:26，  实际为：" << d1 << endl;
		cout << "d2应该是1941-07-10 04:13:25，  实际为：" << d2 << endl;

		d1.set(1941, 7, 10, 4, 13, 25);
		d2 = ++d1;
		cout << "d1应该是1941-07-10 04:13:26，  实际为：" << d1 << endl;
		cout << "d2应该是1941-07-10 04:13:26，  实际为：" << d2 << endl;

		d1.set(1941, 7, 10, 4, 13, 25);
		d2 = d1--;
		cout << "d1应该是1941-07-10 04:13:24，  实际为：" << d1 << endl;
		cout << "d1应该是1941-07-10 04:13:25，  实际为：" << d2 << endl;

		d1.set(1941, 7, 10, 4, 13, 25);
		d2 = --d1;
		cout << "d1应该是1941-07-10 04:13:24，  实际为：" << d1 << endl;
		cout << "d2应该是1941-07-10 04:13:24，  实际为：" << d2 << endl;

		d1.set(1996, 2, 28, 23, 59, 59);
		d2 = d1++;
		cout << "d1应该是1996-02-29 00:00:00，  实际为：" << d1 << endl;
		cout << "d2应该是1996-02-28 23:59:59，  实际为：" << d2 << endl;

		d1.set(1997, 2, 28, 23, 59, 59);
		d2 = d1++;
		cout << "d1应该是1997-03-01 00:00:00，  实际为：" << d1 << endl;
		cout << "d2应该是1997-02-28 23:59:59，  实际为：" << d2 << endl;

		d1.set(1996, 2, 29, 0, 0, 0);
		d2 = d1--;
		cout << "d1应该是1996-02-28 23:59:59，  实际为：" << d1 << endl;
		cout << "d2应该是1996-02-29 00:00:00，  实际为：" << d2 << endl;

		d1.set(1997, 3, 1, 0, 0, 0);
		d2 = d1--;
		cout << "d1应该是1997-02-28 23:59:59，  实际为：" << d1 << endl;
		cout << "d2应该是1997-03-01 00:00:00，  实际为：" << d2 << endl;

		d1.set(2099, 12, 31, 23, 59, 59);
		d2 = d1++;
		cout << "d1应该是1900-01-01 00:00:00，  实际为：" << d1 << endl;
		cout << "d2应该是2099-12-31 23:59:59，  实际为：" << d2 << endl;

		d1.set(1900, 1, 1, 0, 0, 0);
		d2 = d1--;
		cout << "d1应该是2099-12-31 23:59:59，  实际为：" << d1 << endl;
		cout << "d2应该是1900-01-01 00:00:00，  实际为：" << d2 << endl;

		wait_for_enter();
	}

	return 0;
}
